Data/TestFiles/cases/WaterPouring/case/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// OpenCFD:

dynamicFvMesh dynamicMultiMotionSolverFvMesh;
dynamicMultiMotionSolverFvMeshCoeffs
{
    MeshRefinement
    {
        solver solidBody;
        cellZone MeshRefinement;
        solidBodyCoeffs
        {
    	    solidBodyMotionFunction  rotatingMotion;
            rotatingMotionCoeffs
            {
                origin (0.0 0.0 0.0);
                axis (0.0 1.0 0.0);
                omega
                {
                    type    table;
                    values
                    (
						(0.0 3.1578947368421053)
						(0.5 3.1578947368421053)
						(0.501 0.0)
						(2.0 0.0)
						(2.001 -3.1578947368421053)
						(2.5 -3.1578947368421053)

                    );
                }
            }
        }
    }    	
}

// Foundation:

mover
{
    type            motionSolver;
    libs            ("libfvMotionSolvers.so");
    motionSolver    motionSolverList;
    solvers
    {
        MeshRefinement
        {
            motionSolver solidBody;
            cellZone MeshRefinement;
            solidBodyMotionFunction rotatingMotion;
            origin (0.0 0.0 0.0);
            axis (0.0 1.0 0.0);
            omega
            {
                type    table;
                units   ([s] [rpm]);
                values
                (
					(0.0 30.0)
					(0.5 30.0)
					(0.501 0.0)
					(2.0 0.0)
					(2.001 -30.0)
					(2.5 -30.0)

                );
            }
        }
    }
}
//************************************************************************ //
