Data/TestFiles/cases/WaterPouring/case/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000.0;

boundaryField
{
    // Foundation:
    
    nonConformalCyclic_on_MeshRefinement_M 
    {
        type    nonConformalCyclic;
        value   $internalField;
    }

    nonConformalError_on_MeshRefinement_M
    {
        type    nonConformalError;
    }

    nonConformalCyclic_on_MeshRefinement_S 
    {
        type    nonConformalCyclic;
        value   $internalField;
    }

    nonConformalError_on_MeshRefinement_S
    {
        type    nonConformalError;
    }


    MeshRefinement_M 
    {
        #include "MMR/scalar";
    }
    MeshRefinement_S 
    {
        #include "MMR/scalar";
    }


    open
    {
        type        totalPressure;
        p0          uniform 100000.0;
        value       $internalField;
    }

    bottle_wall
    {
        type        fixedFluxPressure;
        value       $internalField;
    }

    cup_wall
    {
        type        fixedFluxPressure;
        value       $internalField;
    }

    side_wall
    {
        type        fixedFluxPressure;
        value       $internalField;
    }

    defaultFaces
    {
        type        fixedFluxPressure;
        value       $internalField;
    }

}

// ************************************************************************* //
